Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PVTS1</name>
      <description>PVTS</description>
      <groupName>PVTS</groupName>
      <baseAddress>0x40043000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xB4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVTS1_CPU1</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>PVTS1_HIFI1</name>
        <value>91</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>PVT[%s]</name>
          <description>Array of registers: ALERT_CNT, ALERT_CNT_CTRL, DEL_CTRL</description>
          <addressOffset>0</addressOffset>
          <register>
            <name>DEL_CTRL</name>
            <description>Delay Control</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DELAY0</name>
                <description>Delay Section 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DELAY1</name>
                <description>Delay Section 1</description>
                <bitOffset>5</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ALERT_CNT</name>
            <description>Alert Counter</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <modifiedWriteValues>clear</modifiedWriteValues>
            <fields>
              <field>
                <name>CNT</name>
                <description>Counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>clear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ALERT_CNT_CTRL</name>
            <description>Alert Counter Control</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CNTEN</name>
                <description>Counter Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISWAKE</name>
                    <description>Disables</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENWAKE</name>
                    <description>Enables</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>SLEEPCON1</name>
      <description>SLEEPCON1</description>
      <groupName>SLEEPCON1</groupName>
      <baseAddress>0x40044000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1F8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SLEEPCON1</name>
        <value>88</value>
      </interrupt>
      <registers>
        <register>
          <name>SLEEPCFG</name>
          <description>Sleep Configuration</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000F402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SENSEP_MAINCLK_SHUTOFF</name>
              <description>VDD1_SENSE Domain sense_main_clk Shut Off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSES_MAINCLK_SHUTOFF</name>
              <description>VDD1_SENSE Domain sense_main_clk_1 Shut Off</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM0_CLK_SHUTOFF</name>
              <description>RAM_ARBITER0 common_ram_clk Shut Off</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM1_CLK_SHUTOFF</name>
              <description>RAM_ARBITER1 sense_ram_clk Shut Off</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMN_MAINCLK_SHUTOFF</name>
              <description>VDDN_COM Domain common_vddn_clk Shut Off</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEDIA_MAINCLK_SHUTOFF</name>
              <description>VDD2_MEDIA and VDDN_MEDIA Domains media_main_clk and media_vddn_clk Shut Off</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_PD</name>
              <description>Xtal Oscillator Power Down</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2_PD</name>
              <description>FRO2 Power Down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOSC_PD</name>
              <description>LPOSC Power Down</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLANA_PD</name>
              <description>Main PLL Analog Function Power Down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLLDO_PD</name>
              <description>Main PLL internal regulator Power Down</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDPLLANA_PD</name>
              <description>Audio PLL Analog Function Power Down</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDPLLLDO_PD</name>
              <description>Audio PLL internal regulator Power Down</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0_PD</name>
              <description>ADC0 Power Down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2_GATE</name>
              <description>FRO2 Gating</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2_NOGATE</name>
                  <description>Removes gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2_GATE</name>
                  <description>Applies gating</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
