Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core1.xml
        <register>
          <name>LP_DENY0</name>
          <description>Low-Power Deny Status 0</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_FLEXCOMM17_LPDENY</name>
              <description>LP_FLEXCOMM17 LPDENY Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM18_LPDENY</name>
              <description>LP_FLEXCOMM18 LPDENY Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM19_LPDENY</name>
              <description>LP_FLEXCOMM19 LPDENY Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM20_LPDENY</name>
              <description>LP_FLEXCOMM20 LPDENY Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14_LPDENY</name>
              <description>LPSPI14 LPDENY Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16_LPDENY</name>
              <description>LPSPI16 LPDENY Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO_LPDENY</name>
              <description>FLEXIO LPDENY Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C15_LPDENY</name>
              <description>LPI2C15 LPDENY Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
