Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core1.xml
        <register>
          <name>PDCFGSTATUS0</name>
          <description>PD Configuration Status 0</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xF5776740</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMICMODE</name>
              <description>PMIC_MODE Output Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMIC_00</name>
                  <description>PMIC_MODE[1:0] pins = 00</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMIC_01</name>
                  <description>PMIC_MODE[1:0] pins = 01</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMIC_10</name>
                  <description>PMIC_MODE[1:0] pins = 10</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMIC_11</name>
                  <description>PMIC_MODE[1:0] pins = 11</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDSR</name>
              <description>FDSR Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Power switches and DSR status are determined by the single power domain controls</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDSR</name>
                  <description>All core domains are in FDSR mode or power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD</name>
              <description>DPD Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEP_EN</name>
                  <description>Enables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_PD</name>
                  <description>Activates isolation and correct sequencing for DPD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDPD</name>
              <description>FDPD Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFDEEP_EN</name>
                  <description>Enables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDPD</name>
                  <description>Activates isolation and correct sequencing for FDPD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2COMP_DSR</name>
              <description>DSR of VDD2_COMP Domain</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>DSR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2NMED_DSR</name>
              <description>DSR of VDD2_MEDIA and VDDN_MEDIA Domains</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>DSR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2COM_DSR</name>
              <description>DSR of VDD2_COM Domain</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>DSR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VNCOM_DSR</name>
              <description>DSR of VDDN_COM Domain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>DSR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2DSP_PD</name>
              <description>HiFi4 Power Down</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSP_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_PD</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2MIPI_PD</name>
              <description>MIPI PHY Power Down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_MODE</name>
              <description>DCDC Power Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_HP</name>
                  <description>DCDC in high-power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_LP</name>
                  <description>DCDC in low-power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_ULP0</name>
                  <description>DCDC in ultra-low-power mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_ULP1</name>
                  <description>DCDC in ultra-low-power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_VSEL</name>
              <description>DCDC Voltage Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_VSEL0</name>
                  <description>[VSEL0] level selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_VSEL1</name>
                  <description>[VSEL1] level selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO1_MODE</name>
              <description>LDO VDD1 Regulator Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_VDD1_SWITCH</name>
                  <description>LDO VDD1 is in bypass mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD1_HP</name>
                  <description>LDO VDD1 is in high-power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD1_LP_2</name>
                  <description>LDO VDD1 is in low-power mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD1_LP_3</name>
                  <description>LDO VDD1 is in low-power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO1_VSEL</name>
              <description>LDO VDD1 Voltage Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL00</name>
                  <description>LDOVDD1VSEL[VSEL0] and LVDVDD1CTRL[LVL0] level selected (lowest voltage)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL01</name>
                  <description>LDOVDD1VSEL[VSEL1] and LVDVDD1CTRL[LVL1] level selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL10</name>
                  <description>LDOVDD1VSEL[VSEL2] and LVDVDD1CTRL[LVL2] level selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL11</name>
                  <description>LDOVDD1VSEL[VSEL3] and LVDVDD1CTRL[LVL3] level selected (highest voltage)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO2_MODE</name>
              <description>LDO VDD2 Regulator Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_VDD2_SWITCH</name>
                  <description>LDO VDD1 is in bypass mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD2_HP</name>
                  <description>LDO VDD2 is in high-power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD2_LP_2</name>
                  <description>LDO VDD2 is in low-power mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD2_LP_3</name>
                  <description>LDO VDD2 is in low-power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO2_VSEL</name>
              <description>LDO VDD2 Voltage Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL00</name>
                  <description>LDOVDD2VSEL[VSEL0] and LVDVDD2CTRL[LVL0] level selected (lowest voltage)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL01</name>
                  <description>LDOVDD2VSEL[VSEL1] and LVDVDD2CTRL[LVL1] level selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL10</name>
                  <description>LDOVDD2VSEL[VSEL2] and LVDVDD2CTRL[LVL2] level selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL11</name>
                  <description>LDOVDD2VSEL[VSEL3] and LVDVDD2CTRL[LVL3] level selected (highest voltage)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBB1_PD</name>
              <description>Power Down RBB in VDD1 domain</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables RBB if the aggregated value of [AFBB1_PD] = 1, otherwise RBB is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFBB1_PD</name>
              <description>AFBB Power Down in VDD1 domain</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBB2_PD</name>
              <description>RBB Power Down in VDD2 domain</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables RBB if the aggregated value of [AFBB2_PD] = 1, otherwise RBB is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFBB2_PD</name>
              <description>AFBB Power Down in VDD2 domain</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBBN_PD</name>
              <description>RBB Power Down in VDDN domain</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables RBB if the aggregated value of [AFBBN_PD] = 1, otherwise RBB is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFBBN_PD</name>
              <description>AFBB Power Down in VDDN domain</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBBSR1_PD</name>
              <description>Power Down SRAM RBB in VDD1 Domain</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBBSR2_PD</name>
              <description>SRAM RBB Power Down in VDD2 Domain</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
