Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core1.xml
        <register>
          <name>TCR2</name>
          <description>Transmit Configuration 2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Bit Clock Divide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYP</name>
              <description>Bit Clock Bypass</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCD</name>
              <description>Bit Clock Direction</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_IN_TARGET</name>
                  <description>Generate externally in Target mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_IN_CONTROLLER</name>
                  <description>Generate internally in Controller mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCP</name>
              <description>Bit Clock Polarity</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSEL</name>
              <description>MCLK Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_CLOCK</name>
                  <description>Bus clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCLK1</name>
                  <description>Audio clock (MCLK) option 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCLK2</name>
                  <description>Audio clock (MCLK) option 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCLK3</name>
                  <description>Audio clock (MCLK) option 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCI</name>
              <description>Bit Clock Input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCS</name>
              <description>Bit Clock Swap</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Use the normal bit clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Swap the bit clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC</name>
              <description>Synchronous Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>Asynchronous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_W_RX</name>
                  <description>Synchronous with receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR3</name>
          <description>Transmit Configuration 3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDFL</name>
              <description>Word Flag Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCE</name>
              <description>Transmit Channel Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR4</name>
          <description>Transmit Configuration 4</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSD</name>
              <description>Frame Sync Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_IN_TARGET_MODE</name>
                  <description>Generated externally in Target mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_IN_CONTROLLER_MODE</name>
                  <description>Generated internally in Controller mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSP</name>
              <description>Frame Sync Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONDEM</name>
              <description>On-Demand Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS_FRAME_SYNC</name>
                  <description>Generated continuously</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_DEMAND_FRAME_SYNC</name>
                  <description>Generated after the FIFO warning flag is cleared</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSE</name>
              <description>Frame Sync Early</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>First bit of the frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>One bit before the first bit of the frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MF</name>
              <description>MSB First</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LSB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MSB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHMOD</name>
              <description>Channel Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDM_MODE</name>
                  <description>TDM mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_MODE</name>
                  <description>Output mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYWD</name>
              <description>Sync Width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRSZ</name>
              <description>Frame Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPACK</name>
              <description>FIFO Packing Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable FIFO packing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_BIT_FIFO_PACKING</name>
                  <description>Enable 8-bit FIFO packing</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN_BIT_FIFO_PACKING</name>
                  <description>Enable 16-bit FIFO packing</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCONT</name>
              <description>FIFO Continue on Error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Continue from the start of the next frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Continue from the same word that caused the FIFO error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR5</name>
          <description>Transmit Configuration 5</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBT</name>
              <description>First Bit Shifted</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEX0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_1</name>
                  <description>FBT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_2</name>
                  <description>FBT</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_3</name>
                  <description>FBT</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_4</name>
                  <description>FBT</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_5</name>
                  <description>FBT</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_6</name>
                  <description>FBT</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_7</name>
                  <description>FBT</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_8</name>
                  <description>FBT</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_9</name>
                  <description>FBT</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX31</name>
                  <description>31</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>W0W</name>
              <description>Word 0 Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_9</name>
                  <description>(W0W value + 1)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_10</name>
                  <description>(W0W value + 1)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_11</name>
                  <description>(W0W value + 1)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_12</name>
                  <description>(W0W value + 1)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_13</name>
                  <description>(W0W value + 1)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_14</name>
                  <description>(W0W value + 1)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_15</name>
                  <description>(W0W value + 1)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_16</name>
                  <description>(W0W value + 1)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WNW</name>
              <description>Word N Width</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_9</name>
                  <description>(WNW value + 1)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_10</name>
                  <description>(WNW value + 1)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_11</name>
                  <description>(WNW value + 1)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_12</name>
                  <description>(WNW value + 1)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_13</name>
                  <description>(WNW value + 1)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_14</name>
                  <description>(WNW value + 1)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_15</name>
                  <description>(WNW value + 1)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_16</name>
                  <description>(WNW value + 1)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR0</name>
          <description>Transmit Data</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDR</name>
              <description>Transmit Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TFR0</name>
          <description>Transmit FIFO</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFP</name>
              <description>Read FIFO Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WFP</name>
              <description>Write FIFO Pointer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
