Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core1.xml
        <register>
          <name>VideoAlphaBlendConfig</name>
          <description>Alpha Blending Configuration</description>
          <addressOffset>0x2078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALPHA_BLEND</name>
              <description>Alpha Blending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables alpha blending for video.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables alpha blending for video.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_ALPHA_MODE</name>
              <description>Source Alpha Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal source alpha mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERSED</name>
                  <description>Inversed alpha mode if the internal alpha rule needs to be followed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_GLOBAL_ALPHA_MODE</name>
              <description>Source Global Alpha Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal source alpha mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLOBAL</name>
                  <description>Global source alpha mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALED</name>
                  <description>Scaled (by the global alpha value) source alpha mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_BLENDING_MODE</name>
              <description>Source Blending Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Each component of the color is multiplied by (0, 0, 0,0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Each component of the color is multiplied by (1, 1, 1,1).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal as the result color is the source color</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERSED</name>
                  <description>Not affected by the color of the underlying pixel</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_ALPHA_FACTOR</name>
              <description>Source Alpha Factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Do not generate the blending factor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Generates the blending factor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_ALPHA_MODE</name>
              <description>Destination Alpha Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal destination alpha mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERSED</name>
                  <description>Inversed alpha mode if the internal alpha rule needs to be followed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_GLOBAL_ALPHA_MODE</name>
              <description>Destination Global Alpha Mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal destination alpha mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLOBAL</name>
                  <description>Global destination alpha mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALED</name>
                  <description>Scaled (by the global alpha value) destination alpha mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_BLENDING_MODE</name>
              <description>Destination Alpha Blending Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Each component of the color is multiplied by (0, 0, 0,0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Each component of the color is multiplied by (1, 1, 1,1).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal as the result color is the destination color</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERSED</name>
                  <description>Not affected by the color of the underlying pixel</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_ALPHA_FACTOR</name>
              <description>Destination Alpha Factor</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Do not generate the blending factor for destination alpha.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Generates the blending factor for destination alpha.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OverlayConfig</name>
          <description>Overlay Configuration</description>
          <addressOffset>0x207C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>Overlay Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No overlay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4R4G4B4</name>
                  <description>Overlay format is A4R4G4B4.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1R5G5B5</name>
                  <description>Overlay format is A1R5G5B5.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R5G6B5</name>
                  <description>Overlay format is R5G6B5.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A8R8G8B8</name>
                  <description>Overlay format is A8R8G8B8.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A8R5G6B5</name>
                  <description>Overlay format is A8R5G6B5.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables this overlay layer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables this overlay layer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLEAR_EN</name>
              <description>Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables clearing the overlay layer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables clearing the overlay layer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWIZZLE</name>
              <description>RGB Swizzle</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB</name>
                  <description>Input pixel in ARGB format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA</name>
                  <description>Input pixel in RGBA format</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABGR</name>
                  <description>Input pixel in ABGR format</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGRA</name>
                  <description>Input pixel in BGRA format</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UV_SWIZZLE</name>
              <description>UV Swizzle</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_KEY_EN</name>
              <description>Color Keying</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables color keying.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables color keying.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEC_MODE</name>
              <description>Decompression Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables decompression.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SAMPLE</name>
                  <description>Non Subsample</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSAMPLE</name>
                  <description>Horizontal Subsample</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HV_SAMPLE</name>
                  <description>Horizontal Vertical Subsample</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETC2</name>
                  <description>ETC2</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROT_ANGLE</name>
              <description>Rotation Angle</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROT0</name>
                  <description>Sets the rotation angle to 0 degree.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT180</name>
                  <description>Sets the rotation angle to 180 degree.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLIP_X</name>
                  <description>Flips horizontal</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLIP_Y</name>
                  <description>Flips vertical</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OverlayAddress</name>
          <description>Overlay Address</description>
          <addressOffset>0x2080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Starting Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OverlayStride</name>
          <description>Overlay Stride</description>
          <addressOffset>0x2084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STRIDE</name>
              <description>Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DcOverlayTileInCfg</name>
          <description>Tile Input Configuration</description>
          <addressOffset>0x2088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TILE_FORMAT</name>
              <description>Tile Input Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No tile input. See DcOverlayTileInCfg[TILE_FORMAT1].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>Sets the tile input format to ARGB8888.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUY2</name>
                  <description>Sets the tile input format to YUY2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NV12</name>
                  <description>Sets the tile input format to NV12.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YUV_STANDARD</name>
              <description>YUV Standard</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT601</name>
                  <description>Selects the YUV standard BT601.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT709</name>
                  <description>Selects the YUV standard BT709.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TILE_FORMAT1</name>
              <description>Tile Format 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DcTileUvOverlayAdr</name>
          <description>Tile Uv Overlay Address</description>
          <addressOffset>0x208C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Starting Overlay Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DcTileUvOverlayStr</name>
          <description>Tile Uv Overlay Stride</description>
          <addressOffset>0x2090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STRIDE</name>
              <description>Overlay Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OverlayTL</name>
          <description>Overlay Top Left</description>
          <addressOffset>0x2094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>X</name>
              <description>Left Boundary</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Top Boundary</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OverlaySize</name>
          <description>Overlay Size</description>
          <addressOffset>0x2098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEIGHT</name>
              <description>Height</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
