Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core1.xml
        <register>
          <name>CursorLocation</name>
          <description>Cursor Location</description>
          <addressOffset>0x212C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>X</name>
              <description>X</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CursorBackground</name>
          <description>Cursor Background Color</description>
          <addressOffset>0x2130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLUE</name>
              <description>Blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GREEN</name>
              <description>Green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RED</name>
              <description>Red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CursorForeground</name>
          <description>Cursor Foreground Color</description>
          <addressOffset>0x2134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLUE</name>
              <description>Blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GREEN</name>
              <description>Green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RED</name>
              <description>Red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DisplayIntr</name>
          <description>Display Interrupt</description>
          <addressOffset>0x2138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISP0</name>
              <description>Display_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DISP0_DBI_CFG_ERROR</name>
              <description>Display_0 DBI Configure Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PANEL_UNDERFLOW</name>
              <description>Panel Underflow</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_RESET_DONE</name>
              <description>Soft Reset Done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUS_ERROR</name>
              <description>Bus Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DisplayIntrEnable</name>
          <description>Display Interrupt Enable</description>
          <addressOffset>0x213C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISP0</name>
              <description>Display_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables Display_0 interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables Display_0 interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISP0_DBI_CFG_ERROR</name>
              <description>Display_0 DBI Configuration Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables Display_0 DBI configuration error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables Display_0 DBI configuration error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PANEL_UNDERFLOW</name>
              <description>Panel Underflow</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables panel underflow interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables panel underflow interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFT_RESET_DONE</name>
              <description>Soft Reset Done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables soft reset done interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENSABLED</name>
                  <description>Enables soft reset done interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUS_ERROR</name>
              <description>Bus Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables bus error interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables bus error interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DbiConfig0</name>
          <description>DBI Configuration</description>
          <addressOffset>0x2140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBI_TYPE</name>
              <description>DBI Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPE_AFIXED_E</name>
                  <description>Selects DBI Type A Fixed E mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPE_ACLOCK_E</name>
                  <description>Selects DBI Type A Clocked E mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPE_B</name>
                  <description>Selects DBI type B.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBI_DATA_FORMAT</name>
              <description>DBI Data Format</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D8R3G3B2</name>
                  <description>D8R3G3B2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8R4G4B4</name>
                  <description>D8R4G4B4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8R5G6B5</name>
                  <description>D8R5G6B5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8R6G6B6</name>
                  <description>D8R6G6B6</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8R8G8B8</name>
                  <description>D8R8G8B8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D9R6G6B6</name>
                  <description>D9R6G6B6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16R3G3B2</name>
                  <description>D16R3G3B2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16R4G4B4</name>
                  <description>D16R4G4B4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16R5G6B5</name>
                  <description>D16R5G6B5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16_R6_G6_B6_OP1</name>
                  <description>D16_R6_G6_B6_OP1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16_R6_G6_B6_OP2</name>
                  <description>D16_R6_G6_B6_OP2</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16_R8_G8_B8_OP1</name>
                  <description>D16_R8_G8_B8_OP1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16_R8_G8_B8_OP2</name>
                  <description>D16_R8_G8_B8_OP2</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUS_OUTPUT_SEL</name>
              <description>Output Bus Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPI</name>
                  <description>Uses DPI bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBI</name>
                  <description>Uses DBI bus.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBI_AC_TIME_UNIT</name>
              <description>DBI AC Time Unit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBI_OUTPUT_SWIZZLE</name>
              <description>DBIT Output Swizzle Set</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB</name>
                  <description>RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR</name>
                  <description>BGR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DbiIfReset0</name>
          <description>DBI Interface Reset</description>
          <addressOffset>0x2144</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBI_IF_LEVEL_RESET</name>
              <description>DBI Interface Level Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Resets the DBI bus in idle state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DbiWrChar10</name>
          <description>DBI Write AC Characteristics 1</description>
          <addressOffset>0x2148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBI_WR_PERIOD</name>
              <description>DBI Write Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBI_WR_EOR_WR_ASSERT</name>
              <description>DBI Clock E Signal or WRX Signal Assert</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBI_WR_CS_ASSERT</name>
              <description>DBI Write CS Assert</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DbiWrChar20</name>
          <description>DBI Write AC Characteristics 2</description>
          <addressOffset>0x214C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBI_WR_EOR_WR_DE_ASRT</name>
              <description>DBI Clock E Signal or WRX Signal Desert Assert</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBI_WR_CS_DE_ASRT</name>
              <description>DBI Write CS De-assert</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DbiCmd0</name>
          <description>DBI Command Control</description>
          <addressOffset>0x2150</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBI_COMMAND_WORD</name>
              <description>DBI Command Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DBI_COMMANDFLAG</name>
              <description>DBI Command Flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDRESS</name>
                  <description>Address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_MEM_START</name>
                  <description>Write Memory Start</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARAMETER_OR_DATA</name>
                  <description>Parameter or Data</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DpiConfig0</name>
          <description>DPI Configuration</description>
          <addressOffset>0x2154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPI_DATA_FORMAT</name>
              <description>DPI Data Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D16CFG1</name>
                  <description>D16CFG1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16CFG2</name>
                  <description>D16CFG2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16CFG3</name>
                  <description>D16CFG3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D18CFG1</name>
                  <description>D18CFG1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D18CFG2</name>
                  <description>D18CFG2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D24</name>
                  <description>D24</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPI_COMMAND_MODE</name>
              <description>DPI Command Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables the DPI command mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables the DPI command mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SrcConfigEndian</name>
          <description>Source Endian Configuration</description>
          <addressOffset>0x2160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CONTROL</name>
              <description>Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SWAP</name>
                  <description>No Swap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP_WORD</name>
                  <description>Swap Word</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP_DWORD</name>
                  <description>Swap Dword</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
