Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core1.xml
        <register>
          <name>CPACR</name>
          <description>Coprocessor Access Control Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CP0</name>
              <description>CP0 Privilege.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP1</name>
              <description>CP1 Privilege.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP2</name>
              <description>CP2 Privilege.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP3</name>
              <description>CP3 Privilege.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP4</name>
              <description>CP4 Privilege.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP5</name>
              <description>CP5 Privilege.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP6</name>
              <description>CP6 Privilege.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP7</name>
              <description>CP7 Privilege.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. Any attempted accesses to this coprocessor generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights for this coprocessor.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP10</name>
              <description>CP10 Privilege.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. All accesses to the Floating-point Extension result in NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. Unprivileged access to the Floatingpoint Extension result in NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights to the Floatingpoint Extension.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP11</name>
              <description>CP11 Privilege.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_DENIED</name>
                  <description>Access Denied. All accesses to the Floating-point Extension result in NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ONLY</name>
                  <description>Privileged access only. Unprivileged access to the Floatingpoint Extension result in NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_ACCESS</name>
                  <description>Full access. Full access rights to the Floatingpoint Extension.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NSACR</name>
          <description>Non-secure Access Control Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CP0</name>
              <description>CP0 access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP1</name>
              <description>CP1 access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP2</name>
              <description>CP2 access.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP3</name>
              <description>CP3 access.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP4</name>
              <description>CP4 access.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP5</name>
              <description>CP5 access.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP6</name>
              <description>CP6 access.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP7</name>
              <description>CP7 access.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to this coprocessor generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to this coprocessor permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP10</name>
              <description>CP10 access.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PERMITTED</name>
                  <description>Non-secure accesses to the Floating-point Extension generate a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERMITTED</name>
                  <description>Non-secure access to the Floatingpoint Extension permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP11</name>
              <description>CP11 access.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
